# HookBendRadius Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarBendData..::..HookBendRadius Property
RebarBendData Class See Also
---
The radius of the hook fillets in the Rebar shape.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double HookBendRadius { get; set; }
```

Visual Basic
---
```text
Public Property HookBendRadius As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double HookBendRadius {
	double get ();
	void set (double value);
}
```

# Remarks
Inner radius, not centerline
# See Also
RebarBendData Class
Autodesk.Revit.DB.Structure Namespace